/*Задание 3
Пользователь вводит с клавиатуры четыре цифры.
Необходимо создать число, содержащее эти цифры. На-
пример, если с клавиатуры введено 1, 5, 7, 8 тогда нужно
сформировать число 1578.
 */
Console.Write("Введите четре цифры ");
var a = Convert.ToInt32(Console.Read());
var b = Convert.ToInt32(Console.Read());
var c = Convert.ToInt32(Console.Read());
var d = Convert.ToInt32(Console.Read());

Console.Write($"Введеное число {a=a}{b}{c}{d}" );
