/*Задание 3
Пользователь вводит с клавиатуры четыре цифры.
Необходимо создать число, содержащее эти цифры. На-
пример, если с клавиатуры введено 1, 5, 7, 8 тогда нужно
сформировать число 1578.
 */
Console.WriteLine ("Введите четре цифры ");
var a = Console.ReadLine();
var b = Console.ReadLine();
var c = Console.ReadLine();
var d = Console.ReadLine();
string res;
Console.WriteLine($"Введеное число {res = a + b + c + d}");
